a = float(input('Введите значение А: '))
b = float(input('Введите значение В: '))
c = float(input('Введите значение С: '))
print('Квадратное уравнение: ', a, 'x^2 + ', b, 'x + ', c, '= 0')
maxX = minX = x1 = x2 = 0
D = b ** 2 - 4 * a * c
if D > 0 and a != 0:
    x1 = (- b + D ** 0.5) / (2 * a)
    x2 = (- b - D ** 0.5) / (2 * a)
    minX = min(x1, x2)
    maxX = max(x1, x2)
    print('Корней квадратного уравнения два:', 2,
          '{0:.6g}'.format(minX), '{0:.6g}'.format(maxX))
elif D == 0 and a != 0:
    x1 = - b / (2 * a)
    print('Корень квадратного уравнения один:', 1, '{0:.6g}'.format(x1))
elif D < 0:
    print('!!! Корней у данного квадратного уравнения НЕТ !!!', 0)
